heatedPipeCHT/case/constant/fluid/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/fluid/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    inlet
    {
        type            patch;
        nFaces          500;
        startFace       147500;
    }
    outlet
    {
        type            patch;
        nFaces          500;
        startFace       148000;
    }
    fluid_to_solid
    {
        type            mappedWall;
        inGroups        List<word> 
2
(
wall
mapped
)
;
        nFaces          4000;
        startFace       148500;
        neighbourRegion solid;
        neighbourPatch  solid_to_fluid;
        transformType   none;
    }
)

// ************************************************************************* //
