heatedPipeCHT/case/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    inlet
    {
        type            patch;
        nFaces          660;
        startFace       195340;
    }
    outlet
    {
        type            patch;
        nFaces          660;
        startFace       196000;
    }
    externalWall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          4000;
        startFace       196660;
    }
)

// ************************************************************************* //
