heatedPipeCHT/case/constant/solid/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/solid/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    inlet
    {
        type            patch;
        nFaces          160;
        startFace       43840;
    }
    outlet
    {
        type            patch;
        nFaces          160;
        startFace       44000;
    }
    externalWall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          4000;
        startFace       44160;
    }
    solid_to_fluid
    {
        type            mappedWall;
        inGroups        List<word> 
2
(
wall
mapped
)
;
        nFaces          4000;
        startFace       48160;
        neighbourRegion fluid;
        neighbourPatch  fluid_to_solid;
        transformType   none;
    }
)

// ************************************************************************* //
